In [62]:
import pandas as pd

In [63]:
data={'Name':[1,2,3,4,5,6,7],'Age':[10,20,30,40,45,45,50]}

In [69]:
old_df=pd.DataFrame(data)

In [70]:
dic={"Hello":[1,5,6,3,4,5,6]}

In [71]:
new_df=pd.DataFrame(dic)

In [72]:
res_df=pd.concat([old_df,new_df],axis=1)

In [73]:
res_df

   Name  Age  Hello
0     1   10      1
1     2   20      5
2     3   30      6
3     4   40      3
4     5   45      4
5     6   45      5
6     7   50      6

In [8]:
res_df.isnull().sum()

Name     0
Age      0
Hello    0
dtype: int64

In [9]:
res_df.sum()

Name      28
Age      240
Hello     30
dtype: int64

In [10]:
res_df.loc[0,'Name']="A"
res_df.loc[1,'Name']="B"
res_df.loc[2,'Name']="C"
res_df.loc[3,'Name']="D"
res_df.loc[4,'Name']="E"
res_df.loc[5,'Name']="F"
res_df.loc[6,'Name']="G"

In [11]:
res_df

  Name  Age  Hello
0    A   10      1
1    B   20      5
2    C   30      6
3    D   40      3
4    E   45      4
5    F   45      5
6    G   50      6

In [12]:
res_df['Hello'].value_counts()

5    2
6    2
1    1
3    1
4    1
Name: Hello, dtype: int64

In [13]:
res_df.describe()

             Age     Hello
count   7.000000  7.000000
mean   34.285714  4.285714
std    14.840421  1.799471
min    10.000000  1.000000
25%    25.000000  3.500000
50%    40.000000  5.000000
75%    45.000000  5.500000
max    50.000000  6.000000

In [14]:
res_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Hello   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [15]:
res_df.replace(5,np.nan,inplace=True)

In [16]:
res_df['Hello']=res_df['Hello'].fillna(int(res_df['Hello'].mean()))

In [17]:
res_df

  Name  Age  Hello
0    A   10    1.0
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
4    E   45    4.0
5    F   45    4.0
6    G   50    6.0

In [39]:
res_df=pd.concat([res_df,pd.DataFrame({'Name':['I','I'],'Age':[55,55],'Hello':[8,8]})],axis=0)

In [40]:
res_df

  Name  Age  Hello
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
5    F   45    4.0
6    G   50    6.0
1    I   60    2.0
0    I   55    8.0
1    I   55    8.0

In [43]:
res_df.drop_duplicates(inplace=True)

In [20]:
res_df.iloc[6,1]

50

In [21]:
res_df['Hi']=''

In [44]:
res_df

  Name  Age  Hello
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
5    F   45    4.0
6    G   50    6.0
1    I   60    2.0
0    I   55    8.0

In [23]:
res_df.replace('',np.nan)

  Name  Age  Hello  Hi
0    A   10    1.0 NaN
1    B   20    4.0 NaN
2    C   30    6.0 NaN
3    D   40    3.0 NaN
4    E   45    4.0 NaN
5    F   45    4.0 NaN
6    G   50    6.0 NaN
0    H   55    8.0 NaN
1    I   60    2.0 NaN

In [24]:
del res_df['Hi']

In [25]:
res_df

  Name  Age  Hello
0    A   10    1.0
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
4    E   45    4.0
5    F   45    4.0
6    G   50    6.0
0    H   55    8.0
1    I   60    2.0

In [26]:
res_df.drop(4,inplace=True)

In [27]:
res_df.drop(0,inplace=True)

In [28]:
res_df

  Name  Age  Hello
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
5    F   45    4.0
6    G   50    6.0
1    I   60    2.0

In [32]:
pd.read_html('https://en.wikipedia.org/wiki/Sport')

[    0                                                  1
 0 NaN  This section needs expansion. You can help by ...,
     0                                                  1
 0 NaN  This section needs expansion. You can help by ...,
     0                                                  1
 0 NaN  This section needs additional citations for ve...,
    Rank                                     Sport Estimated Global Following  \
 0     1             Association football (Soccer)                  4 billion
 1     2                                   Cricket                2.5 billion
 2     3                    Hockey (Ice and Field)                  2 billion
 3     4                                    Tennis                  1 billion
 4     5  Volleyball (along with Beach Volleyball)                900 million
 5     6                              Table tennis                875 million
 6     7                                Basketball                825 million
 7     8                                  Baseball                500 million
 8     9                  Rugby (League and Union)                475 million
 9    10                                      Golf                450 million

                                  Sphere of Influence
 0                                           Globally
 1  primarily UK and Commonwealth, South Asia (Ind...
 2  Europe, North America, Africa, Asia and Australia
 3                                           Globally
 4                    Americas, Europe, Asia, Oceania
 5                                   Mainly East Asia
 6                                           Globally
 7   primarily United States, Caribbean and East Asia
 8  primarily UK, Ireland, France, Italy, Oceania,...
 9  primarily Western Europe, East Asia and North ...  ,
   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteSport  \
 0                                              Types
 1                                            Science
 2                                      Organizations
 3                                           Business
 4                                      Communication
 5                                            Culture
 6                                          Equipment
 7                                           Politics
 8                                    Sport by region
 9                   Sports portal  Category  Outline

   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteSport.1
 0  Individual Team Military sports Parasports Wom...
 1  Exercise Biomechanics Practice Athletic traini...
 2  Clubs Governing bodies Leagues Season School T...
 3  Agents Broadcasting Economics Industry Marketi...
 4  General managers Journalism Magazines Podcasts...
 5  Betting Cheerleaders Entertainment Fan History...
 6  Artificial turf Balls Caving Exercise Flying d...
 7    Sports law Ministries National sport Regulation
 8  Africa Australia Asia Europe North America Oce...
 9                   Sports portal  Category  Outline                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  ,
   vteMajor achievements in sports by nation  \
 0                               Team sports
 1                         Individual sports
 2                             Sports portal

          vteMajor achievements in sports by nation.1
 0  Olympic team ball sports Association football ...
 1  Cycling Figure skating Gymnastics Judo Luge Sw...
 2                                      Sports portal  ,
                                       vteGame genres  \
 0  Chance Guessing Party Redemption Role-playing ...
 1                                List of game genres

                                     vteGame genres.1
 0  Chance Guessing Party Redemption Role-playing ...
 1                                List of game genres  ,
   Authority control                                Authority control.1
 0     International                                               FAST
 1          National  Spain France BnF data Germany Israel United St...
 2             Other                                               NARA]

In [33]:
len(pd.read_html('https://en.wikipedia.org/wiki/Sport'))

8

In [35]:
pd.read_html('https://en.wikipedia.org/wiki/Sport')[3]

,Rank,Sport,Estimated Global Following,Sphere of Influence
0,1,Association football (Soccer),4 billion,Globally
1,2,Cricket,2.5 billion,"primarily UK and Commonwealth, South Asia (Ind..."
2,3,Hockey (Ice and Field),2 billion,"Europe, North America, Africa, Asia and Australia"
3,4,Tennis,1 billion,Globally
4,5,Volleyball (along with Beach Volleyball),900 million,"Americas, Europe, Asia, Oceania"
5,6,Table tennis,875 million,Mainly East Asia
6,7,Basketball,825 million,Globally
7,8,Baseball,500 million,"primarily United States, Caribbean and East Asia"
8,9,Rugby (League and Union),475 million,"primarily UK, Ireland, France, Italy, Oceania,..."
9,10,Golf,450 million,"primarily Western Europe, East Asia and North ..."

In [36]:
df=pd.read_html('https://en.wikipedia.org/wiki/Sport')[3]

In [38]:
df.shape

(10, 4)

In [46]:
df['Rank']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Rank, dtype: int64

In [50]:
df.Rank=df.Rank.astype(float)

In [51]:
df

,Rank,Sport,Estimated Global Following,Sphere of Influence
0,1.0,Association football (Soccer),4 billion,Globally
1,2.0,Cricket,2.5 billion,"primarily UK and Commonwealth, South Asia (Ind..."
2,3.0,Hockey (Ice and Field),2 billion,"Europe, North America, Africa, Asia and Australia"
3,4.0,Tennis,1 billion,Globally
4,5.0,Volleyball (along with Beach Volleyball),900 million,"Americas, Europe, Asia, Oceania"
5,6.0,Table tennis,875 million,Mainly East Asia
6,7.0,Basketball,825 million,Globally
7,8.0,Baseball,500 million,"primarily United States, Caribbean and East Asia"
8,9.0,Rugby (League and Union),475 million,"primarily UK, Ireland, France, Italy, Oceania,..."
9,10.0,Golf,450 million,"primarily Western Europe, East Asia and North ..."

In [52]:
res_df

  Name  Age  Hello
1    B   20    4.0
2    C   30    6.0
3    D   40    3.0
5    F   45    4.0
6    G   50    6.0
1    I   60    2.0
0    I   55    8.0

In [53]:
dic={20:'1'}

In [54]:
res_df['Age']=res_df['Age'].map(dic)

In [55]:
res_df

  Name  Age  Hello
1    B    1    4.0
2    C  NaN    6.0
3    D  NaN    3.0
5    F  NaN    4.0
6    G  NaN    6.0
1    I  NaN    2.0
0    I  NaN    8.0

In [56]:
res_df['Name'].unique()

array(['B', 'C', 'D', 'F', 'G', 'I'], dtype=object)

In [75]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({
    'A': [1, 6, 3, 8],
    'B': [2, 4, 6, 8],
    'C': [3, 6, 9, 12]
})

# print the original dataframe
print("Original DataFrame:")
print(df)

# drop rows where 'A' > 5
df = df.drop(df[df['A'] > 5])

# print the updated dataframe
print("Updated DataFrame:")
print(df)

Original DataFrame:
   A  B   C
0  1  2   3
1  6  4   6
2  3  6   9
3  8  8  12

KeyError: "['A', 'B', 'C'] not found in axis"